<?php 
/*
 * XF-Main 个人主页
 * 由筱锋个人开发，依据作者所需进行开发
 * 禁止商用！
 * 尊重作者的权益
 * 
 * 本页面含有重要参数，请勿随意修改
 * 该页面内容请勿截图外泄，以免造成不必要的后果
 */

// 初始化参数
$setting = array();

/* ----------------------------  WEB控制  ----------------------------- */
// 闭站
$setting['STOP'] = false;

/* ----------------------------  安全通信  ----------------------------- */
// 闭站
$setting['SSID'] = '1144939537';

/* ---------------------------  数据库连接  ---------------------------- */
// 数据库地址
$setting['SQL']['host'] = '127.0.0.1';
// 数据库库名称
$setting['SQL']['dbname'] = 'xf_blog';
// 数据库用户名
$setting['SQL']['username'] = 'root';
// 数据库登陆密码
$setting['SQL']['password'] = 'X+7ily20040722';

/* ---------------------------  数据表信息  ---------------------------- */
// 信息数据表
$setting['SQL_DATA']['OPTIONS'] = 'xf_options';